{
    "/home": {
        "modified": 1686149091094,
        "type": "dir",
        "size": 4096
    },
    "/home/user": {
        "modified": 1686149091094,
        "type": "dir",
        "size": 4096
    },
    "/home/user/help_us_improve.md": {
        "modified": 1686149091095,
        "type": "file",
        "content": "  Thank you for checking out our Careers page! If you have any suggestions, please \n  reach out to hiring@reef.pl. We'll be grateful for your feedback.",
        "size": 151
    },
    "/home/user/how_we_work": {
        "modified": 1686149091095,
        "type": "dir",
        "size": 4096
    },
    "/home/user/how_we_work/asynchronous.md": {
        "modified": 1686149091095,
        "type": "file",
        "content": "  We mostly work asynchronously, which means that you're free to code at any hour \n  you like. In any case, our staff members live in different time zones.\n\n  Every week, we hold a status call and a Sociocracy call for the whole team. \n  These two cases are the exceptions to our asynchronicity and are currently \n  scheduled for:\n\n  * Status call: Monday, 10:00 – 12:00 CET\n  * Sociocracy call: Tuesday, 12:00 – 13:00 CET\n\n  Obviously, depending on the project and the client you work for, additional \n  calls may need to be scheduled.\n\n  During Monday status calls, we share insights on the interesting things we've \n  achieved, sum up the previous week's work, and make plans for the week. We may \n  also just have some fun, for example, play a multiplayer game.\n\n  To find out more about Sociocracy, please see [sociocracy](sociocracy.md).",
        "size": 843
    },
    "/home/user/how_we_work/english_only.md": {
        "modified": 1686149091096,
        "type": "file",
        "content": "  We're an international company. Both our staff members and our clients come from \n  many different countries, so we hold all internal and external communications in \n  English. The only exception is one-on-one conversations: if you need to discuss \n  something with a colleague and are more comfortable using another language, \n  you're free to use it.\n\n  For public discussions and announcements, we use English so that no one will \n  feel left out no matter where they come from. This policy means that a \n  communicative level of English is required to work at Reef Technologies.\n\n  If at some point all staff members at Reef Technologies were from the same \n  country where English is a second language, we would _still_ keep all written \n  communication in English out of respect for the people who may join the company \n  in the future.",
        "size": 844
    },
    "/home/user/how_we_work/full_remote.md": {
        "modified": 1686149091096,
        "type": "file",
        "content": "  We are a fully remote software house, which means that we do not have an office \n  at all. All of our staff members are free to work from wherever they see fit. \n  You may work from a coworking space if you so prefer, and we will be happy to \n  refund the cost up to a reasonable amount. It's also okay to work from home or a \n  beach in Bali. It's all up to you, as long as your environment allows for \n  productive coding.",
        "size": 426
    },
    "/home/user/how_we_work/seniors_only.md": {
        "modified": 1686149091096,
        "type": "file",
        "content": "  Our developer team at Reef Technologies is senior-only, and that includes the \n  CEO – he is also a seasoned Python programmer, which means that all decisions at \n  the company are taken with a full understanding of their technical aspects.\n\n  So far, all of our staff members have at least seven years of experience. \n  However, we're open to applications from anyone who's been coding professionally \n  for at least five years – not necessarily in Python, although fluency in this \n  language is obviously a must.\n\n  We love working in a senior-only team because it means no hand-holding and a \n  strong trust in the skills of every colleague. We're all good at what we do, and \n  we focus nearly exclusively on coding and creating solutions for interesting \n  problems. We try to automate all the remaining processes or outsource them to \n  professionals so that us developers can focus on what we love the most: creating \n  software.\n\n  Specifically: unlike many other companies, we never try to convert excellent \n  software engineers into mediocre managers. Instead, we distribute the \n  decision-making process via Sociocracy, and we use support personnel and \n  automation for things that we'd rather not do ourselves. Believe it or not, some \n  people are great at writing the type of document that you are reading right now, \n  and they even enjoy that kind of work. Rather than forcing ourselves to take \n  care of such things, we aggressively delegate them away from engineering.",
        "size": 1493
    },
    "/home/user/how_we_work/sociocracy.md": {
        "modified": 1686149091096,
        "type": "file",
        "content": "  We operate according to the Sociocracy 3.0 decision-making framework that allows \n  all company members to impact the organization. We avoid democratic solutions, \n  as they may cause the majority to dominate the issue, which leaves the minority \n  feeling dissatisfied and disenfranchised.\n\n  In our weekly Sociocracy meetings, everyone is encouraged to raise issues and \n  propose ideas for improving the company. We iterate on a solution until no one \n  feels like they have a reason to give an objection. That is a simplified version \n  of what we actually do that shows the spirit of the process without going into \n  technical details – but the full procedure is more robust.",
        "size": 683
    },
    "/home/user/how_we_work/time_tracking.md": {
        "modified": 1686149091097,
        "type": "file",
        "content": "  Fair compensation in a very flexible work environment is a challenge. At Reef \n  Technologies, nobody controls or oversees the time of day when you work – you \n  are free to set your own schedule.\n\n  We use an app called Hubstaff, which makes it easy to log the time that you work \n  to a specific project. At the end of the billing period, which may be a week or \n  a month, we summarize the tracked time and invoice the client, but also, at the \n  end of the month, a bot summarizes the time tracked by a staff member and \n  multiplies it by their hourly rate to figure out the compensation.",
        "size": 595
    },
    "/home/user/positions": {
        "modified": 1686149091097,
        "type": "dir",
        "size": 4096
    },
    "/home/user/positions/senior-python-backend.md": {
        "modified": 1686149091097,
        "type": "file",
        "content": "  We're constantly looking for Senior Python Developers at Reef Technologies:\n\n  * 45-70 USD or 215-335 PLN per hour\n  * we work 30-40 hours per week\n  * fully remote\n\n\n  * only backend\n  * zero juniors to supervise\n  * diverse projects\n\n\n  * no CV needed to apply\n  * no whiteboard interview\n  * fully paid trial period\n\n  The first stage of the recruitment process is fully automatic and only takes ~10 \n  minutes.\n\n  Have we already convinced you? Just type \"apply_\" and we'll take you right to \n  the application website – all you need is a Github account.\n\n  Would you like to find out more about Reef Technologies? We invite you to look \n  around the console – we've prepared text files that will shed some light on who \n  we are and how we work.\n\n  See you around the catalogs!",
        "size": 784
    },
    "/home/user/projects": {
        "modified": 1686149091097,
        "type": "dir",
        "size": 4096
    },
    "/home/user/projects/code_review_culture.md": {
        "modified": 1686149091097,
        "type": "file",
        "content": "  We maintain a peer-to-peer code review culture based on trust in our senior \n  engineers' skills.\n  All developers at the company are free to ask for a code review and review \n  others' code.\n  We try to avoid micromanagement – we only make minor changes to others' code \n  when someone has a really good reason.",
        "size": 314
    },
    "/home/user/projects/current_projects.md": {
        "modified": 1686149091098,
        "type": "file",
        "content": "  Here's a list of the current projects (starting, running, or just finished):\n\n  * low latency asynchronous processor of CPU-heavy requests (1800s CPU seconds \n  per request done under 30s in 4 chunks that depend on each other using an \n  autoscaling cluster of 64 core VMs)\n  * sdk for accessing a cloud storage leveraging an API versioning convention that \n  allows for introducing new features and fixes without breaking backward \n  compatibility (exterior projects using a version as old as 5 years still work \n  with new releases)\n  * cost optimization system in telco domain\n  * fraud/suspicious operation detection tool for risk analysis consultants and \n  economic police\n  * troubleshooting of a complex failure in an ASGI application (sort of like \n  highly specialized twitter)\n  * a large scale scrape/search system tracking >100 million objects with 200+ \n  fields each",
        "size": 883
    },
    "/home/user/projects/engineer_teamwork.md": {
        "modified": 1686149091098,
        "type": "file",
        "content": "  Reef Technologies is a senior-only company for a reason – we enjoy cooperating \n  on equal terms and taking technical decisions together.\n  We have a genuinely flat management structure with no detached-from-reality CTO \n  telling everyone what to do and how to do it.\n  If you come from a corporate environment or a culture that appreciates an \n  authoritarian leadership style, this may take some time adjusting to, but we \n  believe that taking everyone's opinions into account we can create the best \n  possible software for our clients.",
        "size": 543
    },
    "/home/user/projects/never_boring.md": {
        "modified": 1686149091098,
        "type": "file",
        "content": "  We don't like doing the same thing over and over again, so we make sure that the \n  projects we accept are not only profitable but also sufficiently diverse. We \n  love working with different technologies and using our brainpower and experience \n  to solve authentic and sometimes really original problems. If you join Reef, you \n  can expect to enter the summer working on an entirely different project than \n  what you did in the winter. After all, variety is the spice of life and one of \n  the best ways for an experienced engineer not to get burned out.",
        "size": 560
    },
    "/home/user/projects/past_projects.md": {
        "modified": 1686149091099,
        "type": "file",
        "content": "  Some of our completed projects include:\n\n  * financial data warehouse that aggregates over 31 000 time series into a few \n  hundred charts for a fintech company from London\n  * graph data search/visualization system for auditors/investigators from the \n  Netherlands\n  * super scalable WAF optimized down to extremely low running costs for a client \n  from Chicago, IL\n  * multisource cloud object synthesizer library for a storage provider from San \n  Mateo, CA\n  * report generator/inventory tracker for an e-commerce/healthcare company from \n  Canada\n  * k8s-based revenue optimizer for large private GPU compute clusters in North \n  America\n  * paper product level tracker for toilet cleaners from Canada\n  * hydrant certification report generator for Australian plumbers\n  * multi-tenant hospitality management system for large properties in the US\n  * large scale information display system for retailers (international)\n\n  We're fortunate enough to receive more project offers than we can handle, so we \n  only accept the proposals that seem interesting and challenging enough. We never \n  cooperate with morally questionable organizations.\n\n  Wondering why there are no machine learning projects in this file? To satisfy \n  your curiosity, just have a look at \n  [why_no_machine_learning](why_no_machine_learning.md)",
        "size": 1326
    },
    "/home/user/projects/technologies.md": {
        "modified": 1686149091099,
        "type": "file",
        "content": "  At Reef Technologies, we mostly use Python and Django. We accept very diverse \n  projects, however, and we always adapt our toolset to the issue at hand.\n\n  That means you can expect to use many different frameworks and libraries, but we \n  don't require you to know them all when you apply. If at some point, you need to \n  learn more about a certain technology to contribute to a project or solve an \n  issue, you'll just learn it. Our staff members say that they learn a lot this \n  way.\n\n  We have automated a significant proportion of the environment setup, which \n  allows us to save a lot of time on DevOps and focus on developing the actual \n  project.",
        "size": 662
    },
    "/home/user/projects/why_no_machine_learning.md": {
        "modified": 1686149091099,
        "type": "file",
        "content": "  Reef Technologies does not accept machine learning or data science projects, and \n  there are no plans for this to change. Some of us have sufficient skills to \n  deliver high-quality results in ML and DS, but we all prefer to work on other \n  things.\n\n  We realize that there are many great Python engineers whose primary focus is on \n  machine learning, data science, big data, etc. They will find a lot of work \n  suitable for their style in other companies. With the recent surge of Python \n  engineers whose skills are applicable exclusively for ML, our recruitment \n  process has evolved to efficiently filter those candidates out, leaving only \n  people who are backend engineers like us.\n\n  If you're strongly into machine learning, then this is not the right opportunity \n  for you, but if you're into backend solutions, you'll feel right at home!",
        "size": 858
    },
    "/home/user/recruitment_process": {
        "modified": 1686149091099,
        "type": "dir",
        "size": 4096
    },
    "/home/user/recruitment_process/how_to_apply.md": {
        "modified": 1686149091099,
        "type": "file",
        "content": "  Applying to join Reef Technologies will take you less than a minute:\n\n  Input 'apply_' into the console.\n  Log in with your GitHub account.\n  Tell us your name.\n  That's it. No CV. A bot will send you an exercise to test your basic coding \n  skills.\n\n  That is all there is to it – we know that no one likes to fill out those super \n  long forms. (We don't like it either). If you want to see the full depth of the \n  interview process, please see [recruitment_stages](recruitment_stages.md).\n\n  We hope that you like what you've seen so far. We're constantly looking to \n  expand our team with experienced Python engineers, so don't worry if you're not \n  available right now. We will still be here in a few months, and we'll be happy \n  to wait for you – if you feel like we might be a good fit, don't hesitate and \n  give it a try!\n\n  We'll be looking forward to your application.",
        "size": 885
    },
    "/home/user/recruitment_process/recruitment_stages.md": {
        "modified": 1686149091099,
        "type": "file",
        "content": "  The recruitment process consists of the following stages:\n\n  1. Short, automated scripting task that you can solve whenever you want. You \n  should be done with it in about 20 minutes.\n  2. Time-tracked mini-project. After you complete it, you will receive a personal \n  code review written by one of our senior developers. 73% of candidates who \n  receive such a review reach out to us with positive feedback. Additionally, if \n  you pass the trial period, you will be compensated for the time spent on this \n  task as per the amount of time logged on the time-tracker.\n  3. Video call (mostly to answer any questions that you might have).\n  4. Fully paid trial period where we get to know each other and see if we're a \n  good fit. This goes both ways – it is also your opportunity to see if you will \n  enjoy working here. We treat our trial candidates with full respect, exactly the \n  same as our long-term staff members. That means you will get a realistic display \n  of what it is like to be a developer at Reef Technologies. It's okay if you're \n  still employed at another company at this stage. We conduct the trial period in \n  a way that will not interfere with your day job.\n\n  For details about the timing of the tasks, please see \n  [response_time](response_time.md)\n\n  Want to know more about the trial period? Have a look at \n  [trial_period](trial_period.md)",
        "size": 1378
    },
    "/home/user/recruitment_process/referral_program.md": {
        "modified": 1686149091100,
        "type": "file",
        "content": "  Do you know a skillful senior Python developer who could be interested in \n  working with us? We would love to hear from you if you do! If an engineer that \n  you recommended applies, gets hired, and works for us for 168h, you will be \n  compensated with a success fee of $2048. All you need to do is send us the email \n  address that your friend uses to apply to hiring@reef.pl.",
        "size": 381
    },
    "/home/user/recruitment_process/response_time.md": {
        "modified": 1686149091100,
        "type": "file",
        "content": "  Shortly after you apply, you will receive an automated invitation to an online \n  test. If you pass it, we will invite you to participate in a mini-project within \n  one working day. After you send us your solution, we will try to get back to you \n  with your personal code review within two working days, although in some cases, \n  it may take up to a week. At this point, we will also inform you whether we'd \n  like to invite you to have a chat with our CEO and work with us on a trial \n  period. Please note that it is possible to complete your trial period while \n  still employed full-time.",
        "size": 598
    },
    "/home/user/recruitment_process/trial_period.md": {
        "modified": 1686149091100,
        "type": "file",
        "content": "  After you pass both stages of our recruitment process – that is, a short \n  scripting test and a mini project – you will get invited to a fully paid trial \n  period, which is an opportunity for us to get to know each other and see if we \n  enjoy working together.\n\n  We respect your current professional commitments, so rest assured – our trial \n  period was designed so that it can be completed while still in full-time \n  employment if necessary.\n\n  It's totally okay if you have a notice period at your previous job or if there \n  is something that you need to do before joining the company, such as a move or a \n  vacation. We'll wait for you. We're flexible with most things, really, and the \n  trial period is no exception.\n\n  There is no rule to how long the trial period will take. The record time was one \n  week, but it depends on how much time you need to decide if you want to work \n  with us.",
        "size": 907
    },
    "/home/user/recruitment_process/when_can_i_start.md": {
        "modified": 1686149091100,
        "type": "file",
        "content": "  You can start whenever you want!\n\n  We have no specific deadline, as we are constantly looking to expand our team \n  and hire Senior Python Engineers.\n\n  It's absolutely okay for us if you want to take a holiday or attend to some \n  personal issues before you start the job. Just let us know when you can start. \n  We accept all reasonable requests.",
        "size": 351
    },
    "/home/user/recruitment_process/your_first_day.md": {
        "modified": 1686149091100,
        "type": "file",
        "content": "  We will invite you to Slack, to a place where we store active S3 policies. Then, \n  we'll sign a legal agreement to transfer Intellectual Property and send you a \n  link to our handbook (public on GitHub). Finally, you'll get your first \n  assignments.\n\n  For the handbook, please see \n  [handbook](https://github.com/reef-technologies/handbook/).",
        "size": 349
    },
    "/home/user/what_we_offer": {
        "modified": 1686149091101,
        "type": "dir",
        "size": 4096
    },
    "/home/user/what_we_offer/benefits.md": {
        "modified": 1686149091101,
        "type": "file",
        "content": "  We're a fully remote company, so it would be quite hard for us to organize Fruit \n  Fridays – but that doesn't mean all we do is wire you the money and peace out. \n  We're firmly committed to creating an environment that allows our staff members \n  to enjoy a proper life-work balance. We really believe that life should come \n  first.\n\n  As a developer at Reef Technologies, you can expect the following benefits:\n\n  * Asynchronicity – you choose when to start and finish work. If the project is \n  doing okay, we don't mind when you decide to code. We only hold an average of \n  two synchronized calls per week.\n  * Financial support to pay for a coworking space (up to a reasonable amount) if \n  you need it.\n  * Financial support to buy hardware. (See more at: \n  [hardware_support](hardware_support.md)).\n  * A [private assistant](https://reef.pl/virtual-assistants/).\n  * A modest but functional, zero-approval budget for a server, license, domain \n  etc if you need something to work on a project efficiently. (See more at: \n  [staff_budget](staff_budget.md)).\n\n  Is there some other benefit that you think we should offer? We'll be happy to \n  hear about it, as one final advantage of working with us is Sociocracy – the \n  decision-making process where every individual has a real impact on company \n  policy. See more at: [sociocracy](../how_we_work/sociocracy.md).",
        "size": 1377
    },
    "/home/user/what_we_offer/can_it_be_a_side_job.md": {
        "modified": 1686149091101,
        "type": "file",
        "content": "  We expect about 30 to 40 hours of work each week. Some people see that and ask \n  if they can take on this responsibility in addition to their current job.\n\n  It's ok if you need to keep working at your current job while completing your \n  trial period. We also understand that you may need to serve a notice period when \n  leaving your previous employer... However, at this time, we are only looking for \n  staff members who can set our company as their primary workplace. We have tried \n  a \"side job\" approach a few times, and it always failed very quickly – it seems \n  that it is not possible to sustain such a high amount of productive hours even \n  with good intentions and any amount of support we could provide.\n\n  If you find yourself in such a position, and you're reading this brief message \n  right now, we suggest that you take a few minutes to consider the situation you \n  are in and how you got here. For some reason, you are looking for a job at this \n  very moment, part-time or not. This is most likely because your current \n  workplace is not as good as you deserve it to be. You can deal with it in two \n  ways:\n\n  A) you can cause that workplace to change so that it's better for you (and \n  others there)\n\n  OR\n\n  B) you can switch to another workplace that does not have the problems that are \n  bothering you at your current job\n\n  You are trying to get around that A/B choice, but... have you ever heard from \n  anyone who said they did this, and it ended up very well mid-long term? We have \n  not. In fact, one of the reasons Reef Technologies was created was a very \n  similar situation. The idea of the CEO (unhappily leaving a company that he \n  could not change in 2016) was that we could create a new company with new rules. \n  Whenever someone is unhappy, their peers would try really hard to do something \n  about it. That was the dream...\n\n  ... and it worked! The number of issues that we have addressed got so high that \n  we stopped counting them. Will your current workplace make an extra effort to \n  change itself so that you stop being unhappy, or are the current problems likely \n  to become even worse over time? Where do you want to spend the next couple of \n  years of your life?\n\n  If this is in line with your thinking, then keep getting to know us. :)",
        "size": 2304
    },
    "/home/user/what_we_offer/hardware_support.md": {
        "modified": 1686149091101,
        "type": "file",
        "content": "  We offer to pay 50% of the cost you incur when buying necessary hardware, up to \n  1024 USD per 2 years. The company has 50% ownership of the equipment on the \n  point of purchase, with the percentage decreasing for every hour you work and \n  reaching 0% so that the hardware passes into your full ownership in 2568 hours \n  (or two years of full-time work at 30 hours per week, taking into account \n  holidays, sick days off, etc.).",
        "size": 435
    },
    "/home/user/what_we_offer/our_rates.md": {
        "modified": 1686149091101,
        "type": "file",
        "content": "  We offer employment on a B2B contract with the following rates:\n\n  * 45-70 USD per hour for Senior Python Engineers\n  * 75-90 USD per hour for Staff Python Engineers\n\n  We believe that a sustainable definition of a full-time engagement in a remote \n  setting is approximately 40 hours per week. If you work for about this amount of \n  time, you can expect a monthly salary of:\n\n  * 7560-11760 USD as a Senior Python Engineer\n  * 12600-15120 USD as a Staff Python Engineer\n\n  You can expect to receive a raise at an above-market rate every year. You don't \n  have to make any requests – all staff members get their annual salary raise at \n  the same time.\n\n  Money is not everything, though, and working at Reef involves more than a few \n  things that you will probably enjoy. See more at: [benefits](benefits.md)",
        "size": 814
    },
    "/home/user/what_we_offer/staff_budget.md": {
        "modified": 1686149091101,
        "type": "file",
        "content": "  Our developers are here to solve problems, and we want them to use the most \n  appropriate tools to reach peak productivity while working on projects. That is \n  why if you realize that you need to pay for a new domain, a license, a temporary \n  server, or a new mouse because yours just broke and renders you unable to keep \n  working – you're free to buy it and get the money back from the company. We \n  cover reasonable expenses up to $64 per month.",
        "size": 455
    },
    "/home/user/what_we_offer/staff_error_budget.md": {
        "modified": 1686149091102,
        "type": "file",
        "content": "  We realize that staff members may unknowingly commit errors that come at a cost \n  to the company, such as forgetting to cancel a subscription paid for with a \n  company card.\n\n  The following is our active policy on small-scale operational errors.\n\n  If the operational mistake made by a staff member:\n\n  * cost the company less than 1024 USD in the given month AND\n  * was not fraud as confirmed by our CFO AND\n  * is the first mistake of the given type made by the staff member,\n\n  we will have a \"please don't do that again\" conversation with the staff member, \n  and the company will absorb the cost.",
        "size": 607
    }
}
